# Rebar Create From Curves And Shape Method

Source: https://www.revitapidocs.com/2026/d7771781-4380-5ac1-ea33-3ac49bfac1bc.htm

---

| Rebar Create From Curves And Shape Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CreateFromCurvesAndShape(Document, RebarShape, RebarBarType, Element, XYZ, IList Curve , BarTerminationsData) |  |
|  | CreateFromCurvesAndShape(Document, RebarShape, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IList Curve , RebarHookOrientation, RebarHookOrientation) | **Obsolete.** |
|  | CreateFromCurvesAndShape(Document, RebarShape, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IList Curve , RebarHookOrientation, RebarHookOrientation, Double, Double, ElementId, ElementId) | **Obsolete.** |

Top See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace